package 动态规划

/*
给你一个整数数组 prices ，其中 prices[i] 表示某支股票第 i 天的价格。

在每一天，你可以决定是否购买和/或出售股票。你在任何时候 最多 只能持有 一股 股票。你也可以先购买，然后在 同一天 出售。

返回 你能获得的 最大 利润 。



示例 1：

输入：prices = [7,1,5,3,6,4]
输出：7
解释：在第 2 天（股票价格 = 1）的时候买入，在第 3 天（股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4 。
     随后，在第 4 天（股票价格 = 3）的时候买入，在第 5 天（股票价格 = 6）的时候卖出, 这笔交易所能获得利润 = 6 - 3 = 3 。
     总利润为 4 + 3 = 7 。
示例 2：

输入：prices = [1,2,3,4,5]
输出：4
解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4 。
     总利润为 4 。
示例 3：

输入：prices = [7,6,4,3,1]
输出：0
解释：在这种情况下, 交易无法获得正利润，所以不参与交易可以获得最大利润，最大利润为 0 。

来源：力扣（LeetCode）
链接：https://leetcode.cn/problems/best-time-to-buy-and-sell-stock-ii
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
*/

/*
动态规划，维护二维dp数组，dp[i][0]存放第i天手中不持有股票的最大利润，dp[i][1]中存放第i天持有股票的最大利润
*/
func maxProfit(prices []int) int {
	dp := make([][2]int, len(prices))
	//第0天手中持有股票的话，说明购买了第一天的股票
	dp[0][1] = -prices[0]

	for i := 1; i < len(prices); i++ {
		//第i天不持有股票的最大利润为：前一天也不持有 ｜｜ 前一天持有，今天卖出 二者的最大值
		dp[i][0] = max(dp[i-1][0], dp[i-1][1]+prices[i])
		//第i天持有股票的最大利润为：前一天也持有 ｜｜ 前一天不持有，今天买入 二者的最大值
		dp[i][1] = max(dp[i-1][1], dp[i-1][0]-prices[i])
	}
	//最后一天不持有股票则为整体的最大利润
	return dp[len(prices)-1][0]
}

func max(a, b int) int {
	if a > b {
		return a
	}
	return b
}
